doc/html/troubleshooting.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Troubleshooting Nitrogen Applications</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Troubleshooting Nitrogen Applications"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-11-12 19:50:34 CST"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="stylesheet.css" rel="stylesheet" type="text/css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Troubleshooting Nitrogen Applications</h1>

<p><a href="http://nitrogenproject.com">Home</a> | <a href="./index.html">Getting Started</a> | <a href="./api.html">API</a> | <a href="./elements.html">Elements</a> | <a href="./actions.html">Actions</a> | <a href="./validators.html">Validators</a> | <a href="./handlers.html">Handlers</a> | <a href="./config.html">Configuration Options</a> | <a href="./plugins.html">Plugins</a> | <a href="./jquery_mobile_integration.html">Mobile</a> | <b>Troubleshooting</b> | <a href="./about.html">About</a>
</p>


<div class=headline>Troubleshooting</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Common Questions when Troubleshooting Nitrogen Apps</a></li>
<li><a href="#sec-2">2 What tools do I need for troubleshooting Nitrogen apps?</a></li>
<li><a href="#sec-3">3 I got an error on the Erlang shell. What does it mean?</a></li>
<li><a href="#sec-4">4 I started Nitrogen but nothing is happening. What do I do?</a></li>
<li><a href="#sec-5">5 Why aren't postbacks working?</a></li>
<li><a href="#sec-6">6 My postbacks aren't doing what I expect, how can I figure out what's happening?</a></li>
<li><a href="#sec-7">7 Why isn't upgrading working?</a></li>
<li><a href="#sec-8">8 Other questions not answered here?</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Common Questions when Troubleshooting Nitrogen Apps</h2>
<div class="outline-text-2" id="text-1">


<ul>
<li><a href="#sec-2">What tools do I need for troubleshooting Nitrogen apps?</a>
</li>
<li><a href="#sec-3">I got an error on the Erlang shell. What does it mean?</a>
</li>
<li><a href="#sec-4">I started Nitrogen but nothing is happening. What do I do?</a>
</li>
<li><a href="#sec-5">Why aren't postbacks working?</a>
</li>
<li><a href="#sec-6">My postbacks aren't doing what I expect, how can I figure out what's happening?</a>
</li>
<li><a href="#sec-7">Why isn't upgrading working?</a>
</li>
<li><a href="#sec-8">Other questions not answered here?</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><a name="0" id="0"></a><span class="section-number-2">2</span> What tools do I need for troubleshooting Nitrogen apps?</h2>
<div class="outline-text-2" id="text-2">


<p>
  Here are a few recommendations:
</p>
<ul>
<li>Have <code>sync</code> running. (run in the Erlang shell with <code>sync:go()</code>)

</li>
<li>Have a browser with decent Javsacript debugging and network inspecting
    (Chrome's inspector, Firebug for Firefox, etc). Because Nitrogen does a lot
    of AJAX requests, you'll be watching those requests happen, and when or if
    they error out, you'll see those changes.

</li>
<li>Don't be afraid to use Nitrogen's log handler with: <code>wf:info/1,2</code>,
    <code>wf:warning/1,2</code>, or <code>wf:error/1,2</code> , or send Erlang terms formatted as
    strings to the javascript console with <code>wf:console_log/1,2</code>.

</li>
<li>Finally, when you're really not sure, don't be afraid to dig into the
    nitrogen source code to see what's going on.
</li>
</ul>


</div>

</div>
