doc/html/troubleshooting.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><a name="100" id="100"></a><span class="section-number-2">3</span> I got an error on the Erlang shell. What does it mean?</h2>
<div class="outline-text-2" id="text-3">


<p>
  Erlang errors can be a little scary to the uninitiated, but are very helpful
  once you get the feel for them.  They include relatively complete stack
  traces, so you can see the stack of calling functions (what functions called
  which functions, which lead to this particular crash).
</p>
<p>  
  Conveniently, as of R15, errors at least show line numbers, so you're no
  longer wading throught long, multi-clause functions to find the cause of the
  error. Prior to R15, tracking down the cause of an error in something like an
  <code>event</code> function or a <code>gen_server</code>'s <code>handle_call</code> function was a tedius
  endeavor.
</p>
<p>
  Anyway, here's a pretty typical-looking Nitrogen error:
</p>



<pre class="src src-erlang">=<span class="org-variable-name">INFO</span> <span class="org-variable-name">REPORT</span>==== 28-<span class="org-variable-name">Aug</span>-2013::16:20:02 ===
  {error,error,function_clause,
         [{wf_convert,html_encode,
                      [{link,is_element,element_link,undefined,undefined,
                             undefined,true,[],[],[],[],[],<span class="org-string">"My Link"</span>,[],false,
                             true,false,false,<span class="org-string">"javascript:"</span>,undefined,undefined,
                             false,undefined,undefined},
                       true],
                      [{file,<span class="org-string">"src/lib/wf_convert.erl"</span>},{line,93}]},
          {element_span,render_element,1,
                        [{file,<span class="org-string">"src/elements/html/element_span.erl"</span>},{line,19}]},
          {wf_render_elements,call_element_render,3,
                              [{file,<span class="org-string">"src/lib/wf_render_elements.erl"</span>},
                               {line,130}]},
          {wf_render_elements,render_element,1,
                              [{file,<span class="org-string">"src/lib/wf_render_elements.erl"</span>},
                               {line,115}]},
          {wf_render_elements,render_elements,2,
                              [{file,<span class="org-string">"src/lib/wf_render_elements.erl"</span>},
                               {line,37}]},
          {lists,foldl,3,[{file,<span class="org-string">"lists.erl"</span>},{line,1248}]},
          {wf_render_elements,render_elements,2,
                              [{file,<span class="org-string">"src/lib/wf_render_elements.erl"</span>},
                               {line,32}]},
          {lists,foldl,3,[{file,<span class="org-string">"lists.erl"</span>},{line,1248}]}]}
</pre>


<p>
  Understanding this error takes a little digging. The top line
</p>



<pre class="src src-erlang">{error, error, function_clause
</pre>


<p>  
  Lets us know that a Erlang tried to call a function for which there was no
  matching clause. The next line tells us what function was attempted and what
  arguments were passed to it:
</p>



<pre class="src src-erlang">[{wf_convert,html_encode,
       [{link,is_element,element_link,undefined,undefined,
              undefined,true,[],[],[],[],[],<span class="org-string">"My Link"</span>,[],false,
              true,false,false,<span class="org-string">"javascript:"</span>,undefined,undefined,
              false,undefined,undefined},
        true],
       [{file,<span class="org-string">"src/lib/wf_convert.erl"</span>},{line,93}]},
</pre>


<p>
  This tells us a lot of information. The function was <code>wf_convert:html_encode</code>
  on line 93 in <code>src/lib/wf_convert.erl</code> (which is actually a Nitrogen core
  module). Generally, if the module name starts with <code>wf_</code>, it's probably part
  of Nitrogen core.
</p>
<p>  
  The first argument was that huge tuple that starts with <code>{link</code>, and the
  second argument was the atom <code>true</code>.  This is already giving us a good hint
  as to the cause of the error.
</p>
<p>
  Because Nitrogen elements are simply Erlang records, and Erlang records are
  just syntactic sugar for tuples, we can conclude based on
  <code>{link, is_element,...</code> that the argument that's causing problems is a
  <code>#link</code> element somewhere in our code.
</p>
<p>  
  But if the cause is still not clear, let's go deeper.  The next chunk of the error is this:
</p>



<pre class="src src-erlang">{element_span,render_element,1,
    [{file,<span class="org-string">"src/elements/html/element_span.erl"</span>},{line,19}]},
</pre>


<p>
  This tells us that the <code>element_span:render_element</code> function is calling function. We can imply from this that there is a <code>#span</code> element containing a <code>#link</code> element, and something about that is causing a crash.
</p>
<p>
  If we look at the code of our page, we'll see this line:
</p>



<pre class="src src-erlang">#<span class="org-type">span</span>{text=#<span class="org-type">link</span>{text=<span class="org-string">"My Link"</span>}},
</pre>


<p>
  The error reveals itself: the problem is that you can't pass Nitrogen
  elements into a <code>text</code> attribute. The <code>text</code> attribute of the <code>#span</code> element
  attempts to call <code>html_encode</code> on the <code>#link</code> element, but <code>html_encode</code> only
  accepts text (strings and binaries), so it crashes.
</p>
<p>
  This has been a rather contrived example, but it's the kind of error you may
  run into. Dialyzer support has been added to help eliminate some of this class of error.
</p>
<p>
  If you're really stuck, run dialyzer:
</p>
<pre class="example">
make dialyzer
</pre>


<p>
  Which might give a message like this:
</p>



<pre class="src src-erlang">index.erl:30: <span class="org-variable-name">Record</span> construction #<span class="org-type">span</span>{is_element::<span class="org-string">'is_element'</span>,module::<span class="org-string">'element_span'</span>,
show_if::<span class="org-string">'true'</span>,class::[],style::[],html_id::[],data_fields::[],body::[],
text::#<span class="org-type">link</span>{is_element::<span class="org-string">'is_element'</span>,module::<span class="org-string">'element_link'</span>,show_if::<span class="org-string">'true'</span>,class::[],
style::[],html_id::[],data_fields::[],title::[],text::[32 | 76 | 77 | 105 | 107 | 110
| 121,...],body::[],new::<span class="org-string">'false'</span>,html_encode::<span class="org-string">'true'</span>,mobile_target::<span class="org-string">'false'</span>,
mobile_dialog::<span class="org-string">'false'</span>,url::[58 | 97 | 99 | 105 | 106 | 112 | 114 | 115 | 116 | 118,...],
handle_invalid::<span class="org-string">'false'</span>},title::[],html_encode::<span class="org-string">'true'</span>} violates the declared type <span class="org-keyword">of</span>
field text::<span class="org-type">binary</span>() | <span class="org-builtin">maybe_improper_list</span>(<span class="org-builtin">binary</span>() | <span class="org-builtin">maybe_improper_list</span>(<span class="org-type">any</span>(),<span class="org-builtin">binary</span>()
| []) | <span class="org-builtin">char</span>(),<span class="org-builtin">binary</span>() | [])
</pre>


<p>
  And while this is a hugely long error, the key informaton is the <code>Record   contruction #span</code> is the culprit, and the reason it's failing is <code>violates the   declared type of field text::...</code>. This is telling us that something is wrong
  with the <code>text</code> field, as it's expecting something other than what it was
  given.
</p>
</div>

</div>
